<?php
namespace frontend\models;
use yii\db\ActiveRecord;

class Order extends ActiveRecord{
    public static $status=['0'=>'已取消','1'=>'待付款','2'=>'代发货','3'=>'完成'];
    public static $payments= [
['id' => '1', 'kd' => '货到付款', 'xq' => '送货上门后再收款，支持现金、POS机刷卡、支票支付'],
['id' => '2', 'kd' => '在线支付', 'xq' => '即时到帐，支持绝大数银行借记卡及部分银行信用卡'],
['id' => '3', 'kd' => '上门自提', 'xq' => '自提时付款，支持现金、POS刷卡、支票支付'],
['id' => '4', 'kd' => '邮局汇款', 'xq' => '通过快钱平台收款'],
];
public static $deliveries= [
    ['id' => '1', 'kd' => '普通快递送货上门', 'jq' => '10.00', 'xq' => '每张订单不满499.00元,运费15.00元, 订单4...'],
    ['id' => '2', 'kd' => '特快专递', 'jq' => '40.00', 'xq' => '每张订单不满499.00元,运费40.00元, 订单4...'],
    ['id' => '3', 'kd' => '加急快递送货上门', 'jq' => '10.00', 'xq' => '每张订单不满499.00元,运费15.00元, 订单4...'],
    ['id' => '4', 'kd' => '平邮', 'jq' => '10.00', 'xq' => '每张订单不满499.00元,运费15.00元, 订单4...'],
];
}